<?php

declare(strict_types=1);

namespace Database\Fakers;
use Faker\Provider\Text;

class TextNovel3 extends Text
{
    /**
     * <code>
     * $faker = new \Faker\Generator();
    $faker->addProvider(new Database\Fakers\TextNovel1($faker));
    $faker->realText();
     * </code>
     * @var string
     */
    protected static $baseText = <<<'EOT'
-어떤 醫師의 手記-
그것은 여(余)가 만주를 여행할 때 일이었다. 만주의 풍속도 좀 살필 겸 아직껏 문명의 세례를 받지 못한 그들의 사이에 퍼져 있는 병(病)을 조사할 겸해서 일년의 기한을 예산하여 가지고 만주를 시시콜콜이 다 돌아온 적이 있었다. 그때에 ××촌이라 하는 조그만 촌에서 본 일을 여기에 적고자 한다.

××촌은 조선사람 소작인만 사는 한 이십여 호 되는 작은 촌이었다. 사면을 둘러보아도 한개의 산도 볼 수가 없는 광막한 만주의 벌판 가운데 놓여 있는 이름도 없는 작은 촌이었다. 몽고사람 종자(從者)를 하나 데리고 노새를 타고 만주의 촌촌을 돌아다니던 여가 그 ××촌에 이른 때는 가을도 다 가고 어느덧 광포한 북극의 겨울이 만주를 찾아온 때였다.
만주의 어느 곳이나 조선사람이 없는 곳은 없지만 이러한 오지(奧地)에서 한 동네가 죄 조선 사람뿐으로 되어 있는 곳을 만나니 반가왔다. 더구나 그 동네는 비록 모두가 만주국인의 소작인이라 하나, 사람들이 비교적 온량하고 정직하여, 장성한 이들은 그래도 모두 천자문 한 권쯤은 읽은 사람이었다.
살풍경한 만주, 그 가운데서 살풍경한 살림을 하는 만주국인이며 조선사람의 동네를 근 일년이나 돌아다니다가 비교적 평화스런 이런 동네를 만나면, 그것이 비록 외국인의 동네라 하여도 반갑겠거늘, 하물며 우리 같은 동족임에랴. 여는 그 동네에서 한 십여 일 이상을 일없이 매일 호별 방문을 하며 그들과 이야기로 날을 보내며, 오래간만에 맛보는 평화적 기분을 향락하고 있었다.
'삵'이라는 별명을 가지고 있는 '정A'라는 인물을 본 것이 여기서이다.
A라는 인물의 고향이 어디인지는 ××촌에서 아무도 몰랐다. 사투리로 보아서 경기 사투리인 듯하지만 빠른 말로 재재거리는 때에는 영남 사투리가 보일 때도 있고, 싸움이라도 할 때는 서북 사투리가 보일 때도 있었다. 그런지라 사투리로서 그의 고향을 짐작할 수가 없었다. 쉬운 일본말도 알고, 한문글자도 좀 알고, 중국말은 물론 꽤 하고, 쉬운 러시아말도 할 줄 아는 점 등등, 이곳저곳 숱하게 줏어먹은 것은 짐작이 가지만 그의 경력을 똑똑히 아는 사람은 없었다.
그는 여(余)가 ××촌에 가기 일년 전쯤 빈손으로 이웃이라도 오듯 후덕덕 ××촌에 나타났다 한다. 생김생김으로 보아서 얼굴이 쥐와 같고 날카로운 이빨이 있으며 눈에는 교활함과 독한 기운이 늘 나타나 있으며, 발룩한 코에는 코털이 밖으로까지 보이도록 길게 났고, 몸집은 작으나 민첩하게 되었고, 나이는 스물 다섯에서 사십까지 임의로 볼 수 있으며, 그 몸이나 얼굴 생김이 어디로 보든 남에게 미움을 사고 근접치 못할 놈이라는 느낌을 갖게 한다.
그의 장기(長技)는 투전이 일쑤며, 싸움 잘하고, 트집 잘 잡고, 칼부림 잘하고, 색시에게 덤벼들기 잘하는 것이라 한다.
생김생김이 벌써 남에게 미움을 사게 되었고, 거기다 하는 행동조차 변변치 못한 일만이라, ××촌에서도 아무도 그를 대척하는 사람이 없었다. 사람들은 모두 그를 피하였다. 집이 없는 그였으나 뉘 집에 잠이라도 자러 가면 그 집 주인은 두말 없이 다른 방으로 피하고 이부자리를 준비하여주고 하였다. 그러면 그는 이튿날 해가 낮이 되도록 실컷 잔 뒤에 마치 제 집에서 일어나듯 느직이 일어나서 조반을 청하여 먹고는 한마디의 사례도 없이 나가버린다.
그리고 만약 누구든 그의 이 청구에 응치 않으면 그는 그것을 트집으로 싸움을 시작하고, 싸움을 하면 반드시 칼부림을 하였다.
동네의 처녀들이며 젊은 여인들은 A가 이 동네에 들어온 뒤부터는 마음놓고 나다니지를 못하였다. 철없이 나갔다가 봉변을 당한 사람도 몇이 있었다.
'삵'
이 별명은 누가 지었는지 모르지만 어느덧 ××촌에서는 A를 A라 부르지 않고 '삵'이라고 부르게 되었다.
“삵이 뉘 집에서 묵었나?”
“김 서방네 집에서.”
“다른 봉변은 없었다나?”
“요행히 없었다네.”
그들은 아침에 깨면 서로 인사 대신으로 '삵'의 거취를 알아보고 하였다.
'삵'은 이 동네에는 커다란 암종이었다. '삵' 때문에 아무리 농사에 사람이 부족한 때라도 젊고 튼튼한 몇 사람은 동네의 젊은 부녀를 지키기 위하여 동네 안에 머물러 있지 않을 수가 없었다. '삵' 때문에 부녀와 아이들은 아무리 더운 여름 저녁에라도 길에 나서서 마음놓고 바람을 쏘여보지를 못하였다. '삵' 때문에 동네에서는 닭의 가리며 돼지우리를 지키기 위하여 밤을 새지 않을 수가 없었다.
동네의 노인이며 젊은이들은 몇번을 모여서 '삵'을 이 동리에서 내어쫓기를 의논하였다. 물론 합의는 되었다. 그러나 내어쫓는 데 선착할 사람이 없었다.
“첨지가 선착하면 뒤는 내 담당하마.”
“뒤는 걱정 말고 형님 먼저 말해보시오.”
제각기 '삵'에게 먼저 달겨들기를 피하였다.

이리하여 동리에서는 합의는 되었으나 '삵'은 그냥 태연히 이 동네에 묵어있게 되었다.
“며늘년들이 조반이나 지었나?”
“손주놈들이 잠자리나 준비했나?”
마치 그 동네의 모두가 자기의 집안인 것같이 '삵'은 마음대로 이집 저집을 드나들었다.
××촌에서는 사람이라도 죽으면 반드시 조상 대신으로,
“삵이나 죽지 않고.”
하는 한마디의 말을 잊지 않고 하였다. 누가 병이라도 나면,
“에익! 이 놈의 병 '삵'한테로 가거라.”
고 하였다.
암종 - 누구나 '삵'을 동정하거나 사랑하는 사람이 없었다.
'삵'도 남의 동정이나 사랑은 벌써 단념한 사람이었다. 누가 자기에게 아무런 대접을 하든 탓하지 않았다. 보이는 데서 보이는 푸대접을 하면 그 트집으로 반드시 칼부림까지 하는 그였지만, 뒤에서 아무런 말을 할지라도 - 그리고 그것이 '삵'의 귀에까지 갈지라도 탓하지 않았다.
“흥…”

이 한마디는 그의 가장 큰 처세 철학이었다.
흔히 곁 동네 만주국인들의 투전판에 가서 투전을 하였다. 때때로 두들겨 맞고 피투성이가 되어서 돌아오는 일도 있었다. 그러나 그는 그 하소연을 하는 일이 없었다. 한다 할지라도 들을 사람도 없거니와 - 아무리 무섭게 두들겨 맞은 뒤라도 하루만 샘물에 상처를 씻고 절룩절룩한 뒤에는 또 이튿날은 천연히 나다녔다.
여(余)가 ××촌을 떠나기 전날이었다.

송 첨지라는 노인이 그해 소출을 나귀에 실어 가지고 만주국인 지주가 있는 촌으로 갔다. 그러나 돌아올 때는 송장이 되었다. 소출이 좋지 못하다고 두들겨 맞아서 부러져 꺾어진 송 첨지는 나귀등에 몸이 결박되어서 겨우 ××촌으로 돌아왔다. 그리고 놀란 친척들이 나귀에서 몸을 내릴 때에 절명하였다.
××촌에서는 왁자하였다.
“원수를 갚자!”
명 아닌 목숨을 끊은 송 첨지를 위하여 동네의 젊은이는 모두 흥분하였다. 제각기 이제라도 들고 일어설 듯하였다.
그러나 그뿐이었다. 누구든 앞장을 서려는 사람이 없었다. 만약 이때에 누구든 앞장을 서는 사람만 있었더면 그들은 곧 그 지주에게로 달려갔을지 모른다. 그러나 제가 앞장을 서겠노라고 나서는 사람은 없었다. 제각기 곁사람을 돌아보았다.
발을 굴렀다. 부르짖었다. 학대받는 인종의 고통을 호소하며 울었다. 그러나 - 그뿐이었다. 남의 일로 지주에게 반항하여 제 밥자리까지 떼우기를 꺼림인지, 용감히 앞서 나가는 사람은 없었다.
여는 의사라는 여의 직업상 송 첨지 시체를 검시를 하였다. 돌아오는 길에 여는 '삵'을 만났다. 키가 작은 '삵'을 여는 내려다보았다. '삵'은 여를 쳐다보았다.
‘가련한 인생아. 인종의 거머리야. 가치 없는 인생아. 밥 버러지야. 기생충아!’
여는 '삵'에게 말하였다.

“송 첨지가 죽은 줄 아나?”
여의 말에 아직껏 여를 쳐다보고 있던 '삵'의 얼굴이 아래로 떨어졌다. 그리고 여가 발을 떼려는 순간 얼핏 '삵'의 얼굴에 나타난 비창한 표정을 여는 넘길 수가 없었다.
고향의 떠난 만리 밖에서 학대받는 인종의 가엾음을 생각하고 그 밤은 여도 잠을 못 이루었다.
그 억분함을 호소할 곳도 못 가진 우리의 처지를 생각하고, 여도 눈물을 금치를 못하였다.
A는

이튿날 아침이었다.
여를 깨우러 오는 사람의 소리에 여는 반사적으로 일어났다.
'삵'이 동구(洞口) 밖에서 피투성이가 되어 죽어 있다는 것이었다. 여는 '삵'이라는 말에 눈살을 찌푸렸다. 그러나 의사라는 직업상, 곧 가방을 수습하여 가지고 '삵'이 넘어진 데까지 달려갔다. 송 첨지의 장례식 때문에 모였던 사람 몇은 여의 뒤를 따라왔다.
여는 보았다. '삵'의 허리가 기역자로 뒤로 부러져서 밭고랑 위에 넘어져 있는 것을 여는 달려가 보았다. 아직 약간의 온기는 있었다.
“A! A!”

그러나 그는 정신을 못 차렸다. 여는 응급수단을 취하였다. 그의 사지는 무섭게 경련되었다. 이윽고 그가 눈을 번쩍 떴다.
“A! 정신드나?”
그는 여의 얼굴을 보았다. 끝이 없이 한참을 쳐다보았다. 그의 눈동자가 움직이었다.
겨우 처지를 깨달은 모양이었다.
“선생님, 저는 갔었습니다.”
“어디를?”
“그 놈… 지주 놈의 집에…”
무얼? 여는 눈물 나오려는 눈을 힘있게 닫았다. 그리고 덥석 그의 벌써 식어가는 손을 잡았다. 잠시의 침묵이 계속되었다. 그의 사지에서는 무서운 경련이 끊임없이 일었다. 그것은 죽음의 경련이었다. 듣기 힘든 그의 작은 소리가 또 그의 입에서 나왔다.
“선생님.”
“왜?”
“보고 싶어요. 전 보구 시…”
“뭐이?”
그는 입을 움직였다. 그러나 말이 안나왔다. 기운이 부족한 모양이었다. 잠시 뒤에 그는 또다시 입을 움직였다. 무슨 소리가 그의 입에서 나왔다.
“무얼?”
“보고 싶어요. 붉은 산이 - 그리고 흰 옷이!”
아아, 죽음에 임하여 그의 고국과 동포가 생각난 것이었다. 여는 힘있게 감았던 눈을 고즈너기 떴다. 그때에 '삵'의 눈도 번쩍 뜨이었다. 그는 손을 들려고 하였다. 그러나 이미 부러진 그의 손은 들리지 않았다. 그는 머리를 돌이키려 하였다. 그러나 그런 힘이 없었다.
그의 마지막 힘을 혀끝에 모아가지고 입을 열었다…
“선생님!”
“왜?”
“저것… 저것…”
“무얼?”
“저기 붉은 산이… 그리고 흰 옷이… 선생님 저게 뭐예요!”
여는 돌아보았다. 그러나 거기는 황막한 만주의 벌판이 전개되어 있을 뿐이었다.
“선생님 노래를 불러주세요. 마지막 소원 - 노래를 해주세요. 동해물과 백두산이 마르고 닳도록…”
여는 머리를 끄덕이고 눈을 감았다. 그리고 입을 열었다. 여의 입에서는 창가가 흘러나왔다. 여는 고즈너기 불렀다.
“동해물과 백두산이…”
고즈너기 부르는 여의 창가 소리에 뒤에 둘러섰던 다른 사람의 입에서도 숭엄한 코러스는 울리어나왔다.
무궁화 삼천리
화려 강산…
광막한 겨울의 만주벌 한편 구석에서는 밥 버러지 A의 죽음을 조상하는 숭엄한 노래가 차차 크게 엄숙하게 울리었다. 그 가운데 A의 몸은 점점 식어갔다.
EOT;
}
