<?php

declare(strict_types=1);

namespace Database\Fakers;
use Faker\Provider\Text;

class TextNovel2 extends Text
{
    /**
     * <code>
     * $faker = new \Faker\Generator();
    $faker->addProvider(new Database\Fakers\TextNovel1($faker));
    $faker->realText();
     * </code>
     * @var string
     */
    protected static $baseText = <<<'EOT'
김선생에게,


남조선의 미군정과 나와의 관계를 설명해 달라는 부탁을 받았으니 기꺼이 말씀드릴까 하오.


미국인과 조선인 가운데는 내가 믿을 수 없고 우유부단하고 꾸물거리기를 좋아하는 사람, 그리고 군정청에는 비우호적인 사람으로 생각하는 이들이 꽤 많은 것 같소. 그러나 실정을 들어보면 사실이 그렇지 않다는 게 입증될 것이오. 일의 자초지종과 적절한 배경설명을 위해 처음부터 이야기를 시작하리다.


미군이 서울에 입성한 것은 1945년 9월 9일이었소. 미군의 상륙전 나는 내가 위원장으로 있는 건국준비위원회의 대표로 동생 여운홍과 백상규, 조한용씨를 인천에 파견했소. 나는 하지 L 앞으로 보낸 편지에서 우리가 해방된 데 대한 기쁨을 표현하고 조선인민은 미군과 협력하길 원한다고 썼는데, 이 편지는 하지 L의 보좌관에게만 전해졌고 그에게는 절달되지 않았소. 그렇소, 미군의 상륙전부터 음험한 영향력 때문에 형세는 내게 불리하게 움직였소,

조선에 진주한지 한 달도 더 지난 10월 중순경에 하지 L과 아놀드 L은 나를 짐짓 친절하게 맞이했소. 나는 상해의 3.1운동 시절부터 알고 지내던 황진남씨를 데리고 갔었소.

하지 L은 악수를 나눈 뒤 내게 첫 질문을 던졌소. “왜놈(Jap)과는 무슨 관계가 있느냐?”

내 대답은 “아무것도 없다.”였소. 그러자, 그는 "왜놈으로부터 얼마나 돈을 받았지?"라고 묻더이다. 나는 그의 질문과 불친절한 태도에 기가 막혔소. 다행히 성명서를 준비해 갔기 때문에 이것을 그에게 건네주었소.


내가 자리를 뜨려고 하니까 하지 L은 ‘군정청고문회의’의 고문을 수락하겠느냐고 물어 나는 “아주 기꺼이 수락하겠다.”고 말했소. 나는 옆방으로 안내되었소. 그 방안에는 나를 포함하여 열 명의 조선인들이 있었소. 아홉 사람 가운데 조선인들에게 알려진 사람이라곤 현 한민당 당수인 김성수, 당시의 한민당 당수였던 송진우씨 밖에 없었소. 그 밖의 사람들은 서울에서조차 알려진 사람들도 아닐뿐 아니라, 대개는 평판도 나쁜 자들이었소.

서로 간에 소개인사가 끝난 뒤 고문회의 의장 선거가 실시되었소. 나는 윤기익이라는 사람에게 투표했소. 그런데 개표를 해보니까 김성수씨의 표가 9표더란 말이오.

이 선거 뒤에 다시 경기도지사를 뽑는 투표가 실시되었소. 이번에도 표는 9대 1이더란 말이오. 이쯤 되면 내가 고문회의에 남아 있어보았자 무용하다는 걸 깨닫게 되었소. 저쪽은 똘똘 뭉치고 내 견해는 완전히 묵살되는 것이었소. 그래서 나는 사표를 내놓게 된 것이오.


그 다음에 중요한 사건은 이박사와 굿펠로우 대령의 작품인 소위 ‘남조선 민주의원’에 내가 불참한 일이오. 굿펠로우 대령이 내게 민주의원을 만들자는 제의를 해온 것은 1946년 2월이었는데, 그때 나는 이것이 앞서 말한 군정청 고문회의를 대신하는 하지 L의 최고고문회의라 이해했고, 각계각층의 의견을 반영하는 것인 줄로 알았소.

그러나 민주의원의 개원식이 있기 바로 전날, 중국 중경에서 돌아온 이른바 임시정부 김구 일파의 선전부장인 엄항섭씨가 언론에 성명을 발표하고, 예정된 민주의원을 자기들이 ‘비상국민회의’의 결과라 주장하면서 의원명단을 내놓은 것이오.

명단을 보니 민주의원 의원 30명 가운데 좌익정당의 의석은 겨우 2개밖에 없더란 말이오. 나하고 황진남씨하고. 실정이 이와 같다면 이는 굿펠로우 대령이 내게 한 말과는 정반대가 되니까, 나로선 민주의원에 들어가는 것을 거절할 수 밖에 없었던 거요.

나는 또 ‘남조선과도입법의원’의 참가도 거절했는데, 그 이유는 선거방법이 공정하지 않았기 때문이오. 재선거를 실시해야 한다는 요구가 있었소. 그러나 재선거가 치러진 곳은 겨우 강원도와 서울뿐이었소. 서울에서는 K씨와 그의 부관격인 C모씨가 첫 번째 선거에서는 당선되었는데, 재선거에서는 낙선되었소. 만일 조선인 경찰이 선거에 개입하지 않았더라면 그 결과는 어디서나 다르게 나타났을 것이오. 나에 대한 마지막 주요 비난은 내가 뉴델리로 가겠다 해놓고 안 갔다는 것이오. 그 제안을 받았을 때 나는 대구에 있었소. 미국영사 랭던씨가 장거리 전화를 걸어왔는데, 나는 근로인민당의 반응을 미리 알지 못했던 처지라 가겠다고 승낙했던 것이오. 나는 곧바로 귀경했소. 그런데 내가 재조직을 막 끝낸 근로인민당은 내가 가는 것을 극구반대하면서 당을 위해서는 내가 서울에 있어야만 한다는 것이었소. 게다가 하필 그때 내 집이 폭파되어 반이 허물어졌소. 나는 나만이 아니라 가족 또한 정적들의 공격대상이 되고 있다는 걸 느꼈소. 그러니 가족을 놔두고 길을 떠난다는 것이 괴로웠던 것이오. 심사숙고도 하지않은 채 가겠다고 승낙했던 것에 대해서는 내 자신이 충동적이었다는 것을 시인하오.


이상과 같은 이유들로 해서 내가 미군정에 적대적이라고들 생각하는 모양이지만, 내 쪽에서 미리 협력을 거부한 적은 한 번도 없었소. 언제나 상황이 내게 불리하게 돌아갔던 것이오. 반면에 내가 분명히 말할 수 있는 것은, 군정청은 초기부터 내게 부드러운 감정을 지니지 않았다는 점이오. 현재의 상태를 말하더라도 내가 하고 있는 ‘중외일보’는 해방 후 줄곧 들어있던 그 건물로부터 축출 당했다는 점이오.


나와 나의 보조자들은 군정청의 성실성과 선의를 의심하지 않을 수 없는 일에 부닥칠 때가 많소. 북의 소련인들이 극좌분자를 선호하는 경향이 있다면 이곳 미국인들은 또 극우분자를 두둔하오. 좌파면 누구나, 아니 극우가 아닌 사람들은 누구나 공산주의자로 낙인찍히고 그 활동에 방해를 당하고 있소.


1941년 1월 6일 루즈벨트 대통령은 의회연설에서 세계는 네 가지 기본적인 인간자유를 구축해야 한다고 선포했소.


1.언론의 자유 2.종교의 자유 3.궁핍으로부터의 자유 4. 공포로부터의 자유가 바로 그것이오.


나는 공포로부터의 자유가 없소. 나는 아직도 미군정하에서 국립경찰로 채용된 친일파 손아귀에서 고통받고 있소이다.

이 몇 줄의 짧은 글이 B에게 얼마간이라도 도움이 되기를 바라오. 할 말은 더 많지만, 오늘은 긴요치 않은 장광설로 폐를 끼치고 싶지 않소.


여불비례, 1947년 7월 18일(한국시각으로 7월 19일 아침.) 여운형.
EOT;
}
